{
  "order": 3,
  "title": "iMonstickers",
  "subtitle": "Spooky-cute monster stickers",
  "description": "iMonstickers is a collection of 16 playful stickers made for Messages, featuring little vampires, ghosts, zombies, wizards, and other classic monsters. Each character is full of personality and ready to help you express emotions like surprise, love, fear, excitement, or a simple \"OK!\"\n\nWorks in Messages on iPhone and iPad.",
  "nameOrigin": "These adorable monsters were designed by the brilliant illustrator Raúl Gil (https://raul-gil.com).",
  "imagePath": "/Images/Site/Apps/iMonstickersIcon.png",
  "imageDescription": "iMonstickers app icon - a cute monster character",
  "platforms": ["Messages"],
  "actions": [
    {
      "title": "Install with TestFlight",
      "target": "https://testflight.apple.com/join/v2m7dQBk",
      "style": "primary"
    }
  ],
  "featureGroups": [
    {
      "title": "Express yourself with monsters",
      "features": [
        {
          "title": "16 Unique Characters",
          "description": "A collection of cute and funny monster stickers, including vampires, ghosts, zombies, wizards, and more classic creatures.",
          "imagePath": "/Images/Site/Apps/iMonstickers/UniqueCharacters.png",
          "imageDescription": "Collection of monster stickers"
        },
        {
          "title": "Full of Personality",
          "description": "Each monster is designed with character and emotion, perfect for expressing surprise, love, fear, excitement, or just saying \"OK!\"",
          "imagePath": "/Images/Site/Apps/iMonstickers/FullOfPersonality.png",
          "imageDescription": "Monster stickers showing different emotions"
        },
        {
          "title": "Works in Messages",
          "description": "Seamlessly integrated with the Messages app on iPhone and iPad. Peel and place them anywhere in your conversations.",
          "imagePath": "/Images/Site/Apps/iMonstickers/WorksInMessages.png",
          "imageDescription": "iMonstickers in Messages app"
        }
      ]
    }
  ],
  "whySection": "iMonstickers brings a playful, spooky-cute twist to your Messages conversations. Designed by professional illustrator Raúl Gil, each sticker is crafted with care and personality. Perfect for Halloween or anytime you want to add some monstrous fun to your chats!",
  "supportText": "Have questions about iMonstickers or need help with the sticker pack? We're here to help!",
  "contactEmail": "hello@accessibilityUpTo11.com"
}

