{
  "order": 4,
  "category": "game",
  "slug": "retrorapid",
  "title": "RetroRapid!",
  "subtitle": "Race like it's 1985",
  "description": "RetroRapid brings back the charm of classic LCD handhelds from the late '80s and early '90s. Steer left or right, dodge traffic, and chase your high score. Simple to start, impossible to put down.\n\nBuilt natively for watchOS, iOS, iPadOS, and macOS, RetroRapid fits right in wherever you are: on your wrist, in your pocket, or at your desk.",
  "nameOrigin": "Unexpectedly released with love ❤️ from the ARCtic conference in Oulu, Finland. Thanks to everyone that played the game and encouraged me to push the button.",
  "imagePath": "/Images/Site/Apps/RetroRapidIcon.png",
  "imageDescription": "RetroRapid app icon - A retro-styled racing game icon featuring a classic car in a pixelated LCD game aesthetic",
  "platforms": ["watchOS", "iOS", "iPadOS", "macOS"],
  "actions": [
    {
      "title": "Download from the App Store",
      "target": "https://apps.apple.com/app/id6758641625",
      "style": "primary"
    }
  ],
  "featureGroups": [
    {
      "title": "Race, dodge, repeat.",
      "features": [
        {
          "title": "The look you grew up with",
          "description": "RetroRapid channels the look and feel of the LCD handhelds many of us grew up with, rebuilt with a clean, modern implementation. Unlock Unlimited Play to switch between visual themes and make the retro vibe your own.",
          "imagePath": "/Images/Site/Apps/RetroRapid/ClassicLCDaesthetic.png",
          "imageDescription": "Close-up gameplay screenshot showing RetroRapid's retro LCD-style racing grid with monochrome pixel cars and large red lane controls at the bottom"
        },
        {
          "title": "Native Cross-Platform Play",
          "description": "Whether you're at your desk or on the move, RetroRapid is built natively for watchOS, iOS, iPadOS, and macOS, with a tailored experience on each platform. tvOS is next, and visionOS is on the horizon.",
          "imagePath": "/Images/Site/Apps/RetroRapid/NativeCrossPlatformPlay.png",
          "imageDescription": "A person playing RetroRapid on Apple Watch by the water, demonstrating the native watchOS gameplay experience in a real-world setting"
        },
        {
          "title": "Game Center Competition",
          "description": "Track your best runs with Game Center leaderboards by platform and speed, compare scores with friends, and keep climbing. Achievements are coming soon.",
          "imagePath": "/Images/Site/Apps/RetroRapid/GameCenterCompetition.png",
          "imageDescription": "Apple Games screen showing RetroRapid in the Now Playing section with leaderboard rankings, highlighting Game Center competition"
        }
      ]
    },
    {
      "title": "Built for every player",
      "features": [
        {
          "title": "VoiceOver, Cues, and Haptics",
          "description": "RetroRapid supports VoiceOver and pairs spoken feedback with sound cues and haptics, so you always know where you are, even during the fastest runs.",
          "imagePath": "/Images/Site/Apps/RetroRapid/VoiceOverCuesAndHaptics.png",
          "imageDescription": "RetroRapid main menu with VoiceOver captions visible at the bottom, indicating spoken feedback for accessible navigation"
        },
        {
          "title": "Play your way",
          "description": "Control the game your way with the Digital Crown, taps, swipes, or keyboard. Game controller support is coming soon. You can also tune settings such as font choice and sound effects volume.",
          "imagePath": "/Images/Site/Apps/RetroRapid/FlexibleControlsAndSettings.png",
          "imageDescription": "In-game Controls help panel listing swipe, tap, and keyboard arrow key input options for moving between lanes"
        },
        {
          "title": "Adaptive Interface by Default",
          "description": "RetroRapid respects how you like your screen. Dynamic Type, Dark Mode, and both portrait and landscape orientations are all supported, so the game adapts to your preferences, not the other way around.",
          "imagePath": "/Images/Site/Apps/RetroRapid/AdaptiveInterfaceByDefault.png",
          "imageDescription": "A hand holding an iPhone in portrait orientation running RetroRapid, showing the retro-styled Score display and pixelated car sprites in a real-world setting"
        }
      ]
    }
  ],
  "whySection": "RetroRapid is built around three things: nostalgia, accessibility, and native Apple platform craft. It started as a side project years ago, got its final push from the ARCtic Conference community, and shipped because people were having fun right away. The goal is simple: quick runs, fair challenge, and a game that more people can enjoy.",
  "supportText": "Need help with RetroRapid or want to share feedback? We're here to help you enjoy the retro racing experience!",
  "contactEmail": "hello@accessibilityUpTo11.com"
}

