{
  "order": 4,
  "category": "game",
  "title": "RetroRacing!",
  "subtitle": "Race like it's 1985",
  "description": "⚠️ Very Early Development Notice: RetroRacing is in very early stages of development. Features, gameplay, and design are actively being developed and may change significantly. We appreciate your patience and feedback as we build this retro racing experience!\n\nRetroRacing brings back the charm of classic LCD handheld games from the late '80s and early '90s. Navigate through traffic, avoid obstacles, and compete for the highest score in this nostalgic racing experience.\n\nBuilt for all Apple platforms with accessibility at its core, RetroRacing lets you enjoy retro gaming wherever you are — on your wrist, in your pocket, on your TV, at your desk, or in spatial computing.",
  "nameOrigin": "RetroRacing is named after the golden era of handheld LCD racing games, recreating that simple yet addictive gameplay that kept us entertained for hours.",
  "imagePath": "/Images/Site/Apps/RetroRacingIcon.png",
  "imageDescription": "RetroRacing app icon - A retro-styled racing game icon featuring a classic car in a pixelated LCD game aesthetic",
  "platforms": ["watchOS", "iOS", "iPadOS", "macOS", "tvOS", "visionOS"],
  "actions": [
    {
      "title": "Install with TestFlight",
      "target": "https://testflight.apple.com/join/4bm7BKAm",
      "style": "primary"
    }
  ],
  "featureGroups": [
    {
      "title": "Retro Gaming, Modern Experience",
      "features": [
        {
          "title": "Classic LCD Aesthetic",
          "description": "Experience the nostalgic look and feel of vintage handheld LCD games, reimagined.",
          "imagePath": "/Images/Site/Apps/RetroRacingIcon.png",
          "imageDescription": "Retro LCD game aesthetic"
        },
        {
          "title": "Cross-Platform",
          "description": "Play on any Apple device — Apple Watch, iPhone, iPad, Mac, Apple TV, or Apple Vision Pro. Your progress syncs across all platforms via Game Center.",
          "imagePath": "/Images/Site/Apps/RetroRacingIcon.png",
          "imageDescription": "Multi-platform gaming"
        },
        {
          "title": "Leaderboards & Achievements",
          "description": "Compete with players worldwide through Game Center integration. Track your high scores and unlock achievements as you master the retro racing challenge.",
          "imagePath": "/Images/Site/Apps/RetroRacingIcon.png",
          "imageDescription": "Game Center leaderboards"
        }
      ]
    }
  ],
  "whySection": "RetroRacing is a passion project that celebrates the joy of simple, skill-based gaming while embracing modern technology and accessibility — just pure retro racing fun across all your Apple devices.",
  "supportText": "Need help with RetroRacing or want to share feedback? We're here to help you enjoy the retro racing experience!",
  "contactEmail": "hello@accessibilityUpTo11.com"
}
