{
  "order": 1,
  "category": "app",
  "title": "Xarra",
  "subtitle": "Read, listen (or both), to your articles and documents.",
  "description": "Import an article, a document, or some text, and Xarra will read it out loud while keeping the text in sync on screen. You can follow along line by line, listen hands-free, or switch between the two whenever it suits you.\n\nIt's designed for moments when reading alone isn't ideal, listening alone isn't enough, or when combining both helps you stay focused and engaged with the content.",
  "nameOrigin": "Xarra (pronounced \"CHA-rra\") comes from a Valencian/Catalan word meaning \"to chat\" or \"to talk\".",
  "imagePath": "/Images/Site/Apps/XarraIcon.png",
  "imageDescription": "Xarra app icon - a stylized icon representing text to audio conversion",
  "platforms": ["iOS", "iPadOS"],
  "actions": [
    {
      "title": "Install with TestFlight",
      "target": "https://testflight.apple.com/join/sjk3n7y6",
      "style": "primary"
    }
  ],
  "featureGroups": [
    {
      "title": "Follow along and stay oriented",
      "features": [
        {
          "title": "Synchronized highlighting",
          "description": "As Xarra reads, the current line is highlighted on screen. You can also enable word-level highlighting, using either a background or underline, depending on what you find clearer.",
          "imagePath": "/Images/Site/Apps/Xarra/SynchronizedHighlighting.png",
          "imageDescription": "Side-by-side screenshots of the Xarra app while reading an onboarding document. In both images, the current line “Hello, I am Xarra.” is highlighted as the active line. In the left screenshot, the word “Xarra” is additionally emphasized with an underline. In the right screenshot, the word “Xarra” is highlighted using a darker background, showing two different styles for word-level highlighting during playback."
        },
        {
          "title": "Chapters and navigation",
          "description": "Xarra tries to detect headings and sections, turning them into chapters you can jump between. This makes longer articles or documents easier to explore.",
          "imagePath": "/Images/Site/Apps/Xarra/ChaptersAndNavigation.png",
          "imageDescription": "Screenshot of Xarra showing a Chapters sheet. A list displays detected sections from a document, including “VoiceOver Noise” labeled as Chapter 1 and “Apple’s Use” labeled as Chapter 2. Each chapter appears as a selectable row with a chevron, and a close button is shown in the top-right corner of the sheet."
        },
        {
          "title": "Resume anytime",
          "description": "Progress is saved automatically, so you can stop and continue later without losing your place. Xarra also works with system audio controls from the Lock Screen and Control Center.",
          "imagePath": "/Images/Site/Apps/Xarra/ResumeAnytime.png",
          "imageDescription": "Screenshot of the iOS Control Center showing Xarra integrated with system media controls. The Now Playing tile displays artwork for an audio document titled “iOS 14: Custom Accessibility Content,” along with a pause button and skip backward and skip forward controls that move five lines at a time, indicating playback can be resumed and controlled from the Lock Screen and Control Center."
        }
      ]
    },
    {
      "title": "Bring your content, make it listenable",
      "features": [
        {
          "title": "Text, links, and documents",
          "description": "Add content by typing or pasting text, sharing a web page from Safari or Notes, entering a URL, or importing documents like PDFs from the Files app. Xarra focuses on the readable content and prepares it for listening.",
          "imagePath": "/Images/Site/Apps/Xarra/TextLinksDocuments.png",
          "imageDescription": "Screenshot of the Xarra app showing a context menu titled “From:” with options for adding content. The menu lists Plain Text, Document, URL, and Clipboard, each with an icon, indicating different ways to import text, links, or files into the app for listening."
        },
        {
          "title": "Quick system integration",
          "description": "Use the Share extension to send content into Xarra from anywhere in the system. A couple of taps is all it takes to turn something you're already reading into something you can listen to.",
          "imagePath": "/Images/Site/Apps/Xarra/QuickSystemIntegration.png",
          "imageDescription": "Screenshot of the iOS Share extension showing a web page titled “iOS 14: Custom Accessibility Content” from mobilea11y.com being shared to Xarra. The share sheet displays an Options button and a large checkmark confirmation, indicating that the article has been successfully imported into the app for listening."
        },
        {
          "title": "Synced across your devices",
          "description": "Audio Documents are kept in sync with iCloud, so your library and listening progress follow you across iPhone and iPad. Start listening on one device, pick it up later on another.",
          "imagePath": "/Images/Site/Apps/Xarra/SyncedAcrossYourDevices.png",
          "imageDescription": "Screenshot of the iPad version of Xarra showing a list of Audio Documents synced via iCloud. Each document displays a progress bar and a percentage indicating how much has been listened to. One document is open on the right, where the transcript highlights the last line that was played previously, showing that listening progress is preserved across devices."
        }
      ]
    },
    {
      "title": "Listening, your way",
      "features": [
        {
          "title": "Voices and languages",
          "description": "Xarra supports multiple system voices and automatically detects the language of the content. Whether you're switching between languages or just have a preferred voice, playback adapts without extra setup.",
          "imagePath": "/Images/Site/Apps/Xarra/VoicesAndLanguages.png",
          "imageDescription": "Split screenshot from Xarra. On the left, the Settings screen shows a voice selector with multiple system voices, including enhanced English voices, with one selected. On the right, an Info screen for an Audio Document displays metadata such as the title, export date, detected language set to Spanish, and an automatically generated summary, illustrating voice selection and language detection."
        },
        {
          "title": "Playback speed and preferences",
          "description": "Adjust the reading speed to match your pace. You can also ask Xarra to respect your system's assistive voice and speech rate settings, so it feels consistent with the rest of your device.",
          "imagePath": "/Images/Site/Apps/Xarra/PlaybackSpeedAndPreferences.png",
          "imageDescription": "Side-by-side screenshot from Xarra. On the left, the Settings screen shows playback preferences, including a toggle to respect the device’s assistive technology settings and a selected custom voice. On the right, a playback speed menu is open, listing options from 0.25× to 1.5×, with 1.0× selected, illustrating how users can adjust reading speed."
          
        },
        {
          "title": "Feels at home on iOS and iPadOS",
          "description": "Xarra uses a modern, adaptive interface that works naturally across iPhone and iPad. It supports Split View, Slide Over, Stage Manager, and the new windowing system, and embraces Apple's latest design language, including Liquid Glass. More platforms are on the way.",
          "imagePath": "/Images/Site/Apps/Xarra/FeelsAtHome.png",
          "imageDescription": "Screenshot of Xarra running on iPad in a multi-window setup. The app is open in a resizable window alongside other apps, showing a sidebar list of audio documents on the left and a transcript view on the right. A floating playback control panel with play and skip buttons sits above the content. The interface adapts naturally to the larger screen, demonstrating support for modern iPadOS windowing with Apple’s Liquid Glass visual style."
        }
      ]
    },
    {
      "title": "Accessibility",
      "features": [
        {
          "title": "Designed to work beautifully with assistive technologies",
          "description": "Xarra works thoughtfully with VoiceOver, Switch Control, Full Keyboard Access, and Voice Control. Navigation, playback, and content reading are designed to work with different interaction methods, without assuming how the app will be used.",
          "imagePath": "/Images/Site/Apps/Xarra/DesignedForAssistiveTechnologies.png",
          "imageDescription": "Screenshot of Xarra’s home screen with VoiceOver enabled. The VoiceOver cursor is focused on an Audio Document row titled “Welcome to Xarra,” highlighting the entire row. At the bottom of the screen, the Captions Panel displays VoiceOver’s spoken output for the focused element, showing the document title, source, and progress information."
        },
        {
          "title": "Adaptive by default",
          "description": "Xarra respects system settings like Dynamic Type (including larger accessibility sizes), Reduce Motion, Dark and Light Mode, Increase Contrast, Bold Text, and Differentiate Without Color. The interface adapts to your preferences rather than asking you to adapt to it.",
          "imagePath": "/Images/Site/Apps/Xarra/AdaptiveByDefault.png",
          "imageDescription": "Screenshot of Xarra running in a split iPad layout with large Dynamic Type enabled. The text is displayed at an accessibility size, and a chapter heading (“Chapter 1: What is Xarra?”) is clearly outlined with high contrast. A floating playback control panel sits above the content, showing large, easy-to-target controls. The layout adapts naturally to the larger text size without truncation or overlap."
        },
        {
          "title": "Accessibility, made explicit",
          "description": "Xarra aims to offer the best experience possible for everyone. As a result, it naturally complies with Apple’s Accessibility Nutrition Labels, but it doesn’t stop there. Accessibility is considered throughout the whole experience: how content is imported, how it’s presented, and how it’s listened to. For example, when articles include images with alt text or captions, that information is preserved and included in the audio experience.",
          "imagePath": "/Images/Site/Apps/Xarra/AccessibilityMadeExplicit.png",
          "imageDescription": "Side-by-side screenshot comparison. On the left, Safari displays a blog post containing an image of the VoiceOver rotor set to “More Content.” On the right, the same article is shown in Xarra, where the image’s alt text has been extracted and inserted inline into the text, making the image description readable and listenable as part of the article."
        }
      ]
    }
  ],
  "whySection": "Xarra is built to be helpful, respectful, and easy to trust. It works entirely offline once content is imported, keeping everything on your device. There are no ads, no trackers, and no accounts required. The app is lightweight, quick to download, and focused on doing one thing well helping you engage with text in the way that works best for you.",
  "supportText": "Having trouble getting the most out of Xarra? We're here to help you turn your text into the perfect audio experience!",
  "contactEmail": "hello@accessibilityUpTo11.com"
}

